tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1768_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1768_H_
#define _PIC16F1768_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define CCP1IF                        59
#define CCPIF                         60
#define SSP1IF                        61
#define TXIF                          62
#define RCIF                          63
#define ADIF                          64
#define TMR1GIF                       65
#define PIR2                          66
#define CCP2IF                        67
#define C3IF                          68
#define C4IF                          69
#define BCL1IF                        70
#define C1IF                          71
#define C2IF                          72
#define OSFIF                         73
#define PIR3                          74
#define CLC1IF                        75
#define CLC2IF                        76
#define CLC3IF                        77
#define COG2IF                        78
#define ZCDIF                         79
#define COG1IF                        80
#define PWM5IF                        81
#define PWM6IF                        82
#define PIR4                          83
#define TMR4IF                        84
#define TMR6IF                        85
#define TMR3IF                        86
#define TMR3GIF                       87
#define TMR5IF                        88
#define TMR5GIF                       89
#define TMR0                          90
#define TMR1L                         91
#define TMR1L_TMR                     92
#define TMR1H                         93
#define TMR1H_TMR                     94
#define T1CON                         95
#define T1CON_TMRON                   96
#define TMR1ON                        97
#define T1CON_ON                      98
#define T1ON                          99
#define T1CON_nSYNC                   100
#define T1CON_SYNC                    101
#define nT1SYNC                       102
#define T1OSCEN                       103
#define OSCEN                         104
#define SOSCEN                        105
#define T1CKPS0                       106
#define T1CON_CKPS0                   107
#define T1CON_CKPS                    108
#define T1CON_CKPS1                   109
#define T1CKPS1                       110
#define T1CS0                         111
#define T1CON_CS0                     112
#define TMR1CS0                       113
#define T1CON_CS                      114
#define T1CS1                         115
#define T1CON_CS1                     116
#define TMR1CS1                       117
#define T1GCON                        118
#define T1GCON_GSS0                   119
#define T1GCON_GSS                    120
#define T1GSS0                        121
#define T1GCON_GSS1                   122
#define T1GSS1                        123
#define T1GCON_GVAL                   124
#define T1GVAL                        125
#define T1GGO_nDONE                   126
#define T1GCON_GGO_nDONE              127
#define T1GCON_GSPM                   128
#define T1GSPM                        129
#define T1GTM                         130
#define T1GCON_GTM                    131
#define T1GPOL                        132
#define T1GCON_GPOL                   133
#define T1GCON_GE                     134
#define TMR1GE                        135
#define T1GE                          136
#define T2TMR                         137
#define TMR2                          138
#define T2TMR_TMR                     139
#define T2PR                          140
#define T2PR_PR                       141
#define T2CON                         142
#define T2OUTPS0                      143
#define T2CON_OUTPS0                  144
#define T2OUTPS                       145
#define T2CON_OUTPS                   146
#define T2OUTPS1                      147
#define T2CON_OUTPS1                  148
#define T2OUTPS2                      149
#define T2CON_OUTPS2                  150
#define T2OUTPS3                      151
#define T2CON_OUTPS3                  152
#define T2CKPS0                       153
#define T2CON_CKPS0                   154
#define T2CON_CKPS                    155
#define T2CKPS                        156
#define T2CKPS1                       157
#define T2CON_CKPS1                   158
#define T2CKPS2                       159
#define T2CON_CKPS2                   160
#define T2CON_ON                      161
#define TMR2ON                        162
#define T2ON                          163
#define T2HLT                         164
#define T2HLT_MODE                    165
#define T2MODE                        166
#define T2MODE0                       167
#define T2HLT_MODE0                   168
#define T2MODE1                       169
#define T2HLT_MODE1                   170
#define T2MODE2                       171
#define T2HLT_MODE2                   172
#define T2MODE3                       173
#define T2HLT_MODE3                   174
#define T2MODE4                       175
#define T2HLT_MODE4                   176
#define T2HLT_CKSYNC                  177
#define T2CKSYNC                      178
#define T2HLT_CKPOL                   179
#define T2CKPOL                       180
#define T2PSYNC                       181
#define T2HLT_PSYNC                   182
#define T2CLKCON                      183
#define T2CS                          184
#define T2CS0                         185
#define T2CLKCON_CS                   186
#define T2CLKCON_CS0                  187
#define T2CS1                         188
#define T2CLKCON_CS1                  189
#define T2CS2                         190
#define T2CLKCON_CS2                  191
#define T2CS3                         192
#define T2CLKCON_CS3                  193
#define T2RST                         194
#define T2RSEL0                       195
#define T2RST_RSEL                    196
#define T2RSEL                        197
#define T2RST_RSEL0                   198
#define T2RSEL1                       199
#define T2RST_RSEL1                   200
#define T2RST_RSEL2                   201
#define T2RSEL2                       202
#define T2RSEL3                       203
#define T2RST_RSEL3                   204
#define TRISA                         205
#define TRISA0                        206
#define TRISA1                        207
#define TRISA2                        208
#define TRISA4                        209
#define TRISA5                        210
#define TRISB                         211
#define TRISB4                        212
#define TRISB5                        213
#define TRISB6                        214
#define TRISB7                        215
#define TRISC                         216
#define TRISC0                        217
#define TRISC1                        218
#define TRISC2                        219
#define TRISC3                        220
#define TRISC4                        221
#define TRISC5                        222
#define TRISC6                        223
#define TRISC7                        224
#define PIE1                          225
#define TMR1IE                        226
#define TMR2IE                        227
#define CCP1IE                        228
#define CCPIE                         229
#define SSP1IE                        230
#define TXIE                          231
#define RCIE                          232
#define ADIE                          233
#define TMR1GIE                       234
#define PIE2                          235
#define CCP2IE                        236
#define C3IE                          237
#define C4IE                          238
#define BCL1IE                        239
#define C1IE                          240
#define C2IE                          241
#define OSFIE                         242
#define PIE3                          243
#define CLC1IE                        244
#define CLC2IE                        245
#define CLC3IE                        246
#define COG2IE                        247
#define ZCDIE                         248
#define COGIE                         249
#define PWM5IE                        250
#define PWM6IE                        251
#define PIE4                          252
#define TMR4IE                        253
#define TMR6IE                        254
#define TMR3IE                        255
#define TMR3GIE                       256
#define TMR5IE                        257
#define TMR5GIE                       258
#define OPTION_REG                    259
#define OPTION_REG_PS                 260
#define OPTION_REG_PS0                261
#define OPTION_REG_PS1                262
#define OPTION_REG_PS2                263
#define PSA                           264
#define T0SE                          265
#define TMR0SE                        266
#define T0CS                          267
#define TMR0CS                        268
#define INTEDG                        269
#define nWPUEN                        270
#define PCON                          271
#define nBOR                          272
#define nPOR                          273
#define nRI                           274
#define nRMCLR                        275
#define nRWDT                         276
#define STKUNF                        277
#define STKOVF                        278
#define WDTCON                        279
#define SWDTEN                        280
#define WDTPS                         281
#define WDTPS0                        282
#define WDTPS1                        283
#define WDTPS2                        284
#define WDTPS3                        285
#define WDTPS4                        286
#define OSCTUNE                       287
#define TUN0                          288
#define TUN                           289
#define TUN1                          290
#define TUN2                          291
#define TUN3                          292
#define TUN4                          293
#define TUN5                          294
#define OSCCON                        295
#define SCS0                          296
#define SCS                           297
#define SCS1                          298
#define IRCF                          299
#define IRCF0                         300
#define IRCF1                         301
#define IRCF2                         302
#define IRCF3                         303
#define SPLLEN                        304
#define OSCSTAT                       305
#define HFIOFS                        306
#define LFIOFR                        307
#define MFIOFR                        308
#define HFIOFL                        309
#define HFIOFR                        310
#define OSTS                          311
#define PLLR                          312
#define SOSCR                         313
#define ADRESL                        314
#define ADRESH                        315
#define ADCON0                        316
#define ADON                          317
#define GO_nDONE                      318
#define ADCON0_GO                     319
#define ADGO                          320
#define CHS0                          321
#define CHS                           322
#define CHS1                          323
#define CHS2                          324
#define CHS3                          325
#define CHS4                          326
#define ADCON1                        327
#define ADPREF0                       328
#define ADPREF                        329
#define ADPREF1                       330
#define ADNREF                        331
#define ADCS                          332
#define ADFM                          333
#define ADCON2                        334
#define TRIGSEL                       335
#define TRIGSEL0                      336
#define TRIGSEL1                      337
#define TRIGSEL2                      338
#define TRIGSEL3                      339
#define TRIGSEL4                      340
#define LATA                          341
#define LATA0                         342
#define LATA1                         343
#define LATA2                         344
#define LATA4                         345
#define LATA5                         346
#define LATB                          347
#define LATB4                         348
#define LATB5                         349
#define LATB6                         350
#define LATB7                         351
#define LATC                          352
#define LATC0                         353
#define LATC1                         354
#define LATC2                         355
#define LATC3                         356
#define LATC4                         357
#define LATC5                         358
#define LATC6                         359
#define LATC7                         360
#define CMOUT                         361
#define MC1OUT                        362
#define MC2OUT                        363
#define MC3OUT                        364
#define MC4OUT                        365
#define CM1CON0                       366
#define C1SYNC                        367
#define CM1CON0_SYNC                  368
#define CM1CON0_HYS                   369
#define C1HYS                         370
#define C1SP                          371
#define CM1CON0_ZLF                   372
#define C1ZLF                         373
#define CM1CON0_POL                   374
#define C1POL                         375
#define C1OUT                         376
#define CM1CON0_OUT                   377
#define CM1CON0_ON                    378
#define C1ON                          379
#define CM1CON1                       380
#define C1INTN                        381
#define CM1CON1_INTN                  382
#define CM1CON1_INTP                  383
#define C1INTP                        384
#define CM1NSEL                       385
#define CM1NSEL_NCH0                  386
#define C1NCH0                        387
#define CM1NSEL_NCH                   388
#define C1NCH                         389
#define CM1NSEL_NCH1                  390
#define C1NCH1                        391
#define CM1NSEL_NCH2                  392
#define C1NCH2                        393
#define CM1PSEL                       394
#define CM1PSEL_PCH                   395
#define C1PCH                         396
#define C1PCH0                        397
#define CM1PSEL_PCH0                  398
#define C1PCH1                        399
#define CM1PSEL_PCH1                  400
#define C1PCH2                        401
#define CM1PSEL_PCH2                  402
#define C1PCH3                        403
#define CM1PSEL_PCH3                  404
#define CM2CON0                       405
#define CM2CON0_SYNC                  406
#define C2SYNC                        407
#define C2HYS                         408
#define CM2CON0_HYS                   409
#define C2SP                          410
#define C2ZLF                         411
#define CM2CON0_ZLF                   412
#define C2POL                         413
#define CM2CON0_POL                   414
#define C2OUT                         415
#define CM2CON0_OUT                   416
#define CM2CON0_ON                    417
#define C2ON                          418
#define CM2CON1                       419
#define C2INTN                        420
#define CM2CON1_INTN                  421
#define CM2CON1_INTP                  422
#define C2INTP                        423
#define CM2NSEL                       424
#define C2NCH0                        425
#define CM2NSEL_NCH0                  426
#define C2NCH                         427
#define CM2NSEL_NCH                   428
#define C2NCH1                        429
#define CM2NSEL_NCH1                  430
#define C2NCH2                        431
#define CM2NSEL_NCH2                  432
#define CM2PSEL                       433
#define CM2PSEL_PCH                   434
#define C2PCH                         435
#define C2PCH0                        436
#define CM2PSEL_PCH0                  437
#define C2PCH1                        438
#define CM2PSEL_PCH1                  439
#define CM2PSEL_PCH2                  440
#define C2PCH2                        441
#define CM2PSEL_PCH3                  442
#define C2PCH3                        443
#define CM3CON0                       444
#define C3SYNC                        445
#define CM3CON0_SYNC                  446
#define CM3CON0_HYS                   447
#define C3HYS                         448
#define C3SP                          449
#define CM3CON0_ZLF                   450
#define C3ZLF                         451
#define CM3CON0_POL                   452
#define C3POL                         453
#define C3OUT                         454
#define CM3CON0_OUT                   455
#define CM3CON0_ON                    456
#define C3ON                          457
#define CM3CON1                       458
#define CM3CON1_INTN                  459
#define C3INTN                        460
#define CM3CON1_INTP                  461
#define C3INTP                        462
#define CM3NSEL                       463
#define CM3NSEL_NCH                   464
#define C3NCH                         465
#define C3NCH0                        466
#define CM3NSEL_NCH0                  467
#define C3NCH1                        468
#define CM3NSEL_NCH1                  469
#define C3NCH2                        470
#define CM3NSEL_NCH2                  471
#define CM3PSEL                       472
#define CM3PSEL_PCH0                  473
#define C3PCH                         474
#define CM3PSEL_PCH                   475
#define C3PCH0                        476
#define CM3PSEL_PCH1                  477
#define C3PCH1                        478
#define CM3PSEL_PCH2                  479
#define C3PCH2                        480
#define CM3PSEL_PCH3                  481
#define C3PCH3                        482
#define CM4CON0                       483
#define CM4CON0_SYNC                  484
#define C4SYNC                        485
#define C4HYS                         486
#define CM4CON0_HYS                   487
#define C4SP                          488
#define C4ZLF                         489
#define CM4CON0_ZLF                   490
#define C4POL                         491
#define CM4CON0_POL                   492
#define C4OUT                         493
#define CM4CON0_OUT                   494
#define C4ON                          495
#define CM4CON0_ON                    496
#define CM4CON1                       497
#define C4INTN                        498
#define CM4CON1_INTN                  499
#define CM4CON1_INTP                  500
#define C4INTP                        501
#define CM4NSEL                       502
#define CM4NSEL_NCH                   503
#define C4NCH0                        504
#define C4NCH                         505
#define CM4NSEL_NCH0                  506
#define CM4NSEL_NCH1                  507
#define C4NCH1                        508
#define C4NCH2                        509
#define CM4NSEL_NCH2                  510
#define CM4PSEL                       511
#define CM4PSEL_PCH0                  512
#define C4PCH0                        513
#define C4PCH                         514
#define CM4PSEL_PCH                   515
#define CM4PSEL_PCH1                  516
#define C4PCH1                        517
#define CM4PSEL_PCH2                  518
#define C4PCH2                        519
#define CM4PSEL_PCH3                  520
#define C4PCH3                        521
