tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1768_tdd.h
#define T6CON                         1091
#define T6CON_OUTPS0                  1092
#define T6OUTPS                       1093
#define T6CON_OUTPS                   1094
#define T6OUTPS0                      1095
#define T6CON_OUTPS1                  1096
#define T6OUTPS1                      1097
#define T6CON_OUTPS2                  1098
#define T6OUTPS2                      1099
#define T6CON_OUTPS3                  1100
#define T6OUTPS3                      1101
#define T6CON_CKPS0                   1102
#define T6CKPS                        1103
#define T6CKPS0                       1104
#define T6CON_CKPS                    1105
#define T6CON_CKPS1                   1106
#define T6CKPS1                       1107
#define T6CON_CKPS2                   1108
#define T6CKPS2                       1109
#define TMR6ON                        1110
#define T6ON                          1111
#define T6CON_ON                      1112
#define T6HLT                         1113
#define T6MODE0                       1114
#define T6HLT_MODE0                   1115
#define T6HLT_MODE                    1116
#define T6MODE                        1117
#define T6HLT_MODE1                   1118
#define T6MODE1                       1119
#define T6HLT_MODE2                   1120
#define T6MODE2                       1121
#define T6HLT_MODE3                   1122
#define T6MODE3                       1123
#define T6MODE4                       1124
#define T6HLT_MODE4                   1125
#define T6CKSYNC                      1126
#define T6HLT_CKSYNC                  1127
#define T6CKPOL                       1128
#define T6HLT_CKPOL                   1129
#define T6PSYNC                       1130
#define T6HLT_PSYNC                   1131
#define T6CLKCON                      1132
#define T6CS                          1133
#define T6CLKCON_CS                   1134
#define T6CLKCON_CS0                  1135
#define T6CS0                         1136
#define T6CLKCON_CS1                  1137
#define T6CS1                         1138
#define T6CLKCON_CS2                  1139
#define T6CS2                         1140
#define T6CLKCON_CS3                  1141
#define T6CS3                         1142
#define T6RST                         1143
#define T6RST_RSEL                    1144
#define T6RST_RSEL0                   1145
#define T6RSEL                        1146
#define T6RSEL0                       1147
#define T6RST_RSEL1                   1148
#define T6RSEL1                       1149
#define T6RSEL2                       1150
#define T6RST_RSEL2                   1151
#define T6RST_RSEL3                   1152
#define T6RSEL3                       1153
#define TMR3L                         1154
#define TMR3L_TMR                     1155
#define TMR3H                         1156
#define TMR3H_TMR                     1157
#define T3CON                         1158
#define T3CON_TMRON                   1159
#define TMR3ON                        1160
#define T3CON_ON                      1161
#define T3ON                          1162
#define nT3SYNC                       1163
#define T3CON_nSYNC                   1164
#define T3CON_SYNC                    1165
#define T3CON_CKPS0                   1166
#define T3CKPS0                       1167
#define T3CON_CKPS                    1168
#define T3CON_CKPS1                   1169
#define T3CKPS1                       1170
#define TMR3CS0                       1171
#define T3CON_CS0                     1172
#define T3CS0                         1173
#define T3CON_CS                      1174
#define TMR3CS1                       1175
#define T3CON_CS1                     1176
#define T3CS1                         1177
#define T3GCON                        1178
#define T3GCON_GSS0                   1179
#define T3GSS0                        1180
#define T3GCON_GSS                    1181
#define T3GCON_GSS1                   1182
#define T3GSS1                        1183
#define T3GCON_GVAL                   1184
#define T3GVAL                        1185
#define T3GCON_GGO_nDONE              1186
#define T3GGO_nDONE                   1187
#define T3GSPM                        1188
#define T3GCON_GSPM                   1189
#define T3GCON_GTM                    1190
#define T3GTM                         1191
#define T3GPOL                        1192
#define T3GCON_GPOL                   1193
#define TMR3GE                        1194
#define T3GCON_GE                     1195
#define T3GE                          1196
#define TMR5L                         1197
#define TMR5L_TMR                     1198
#define TMR5H                         1199
#define TMR5H_TMR                     1200
#define T5CON                         1201
#define TMR5ON                        1202
#define T5CON_ON                      1203
#define T5ON                          1204
#define T5CON_TMRON                   1205
#define T5CON_SYNC                    1206
#define T5CON_nSYNC                   1207
#define nT5SYNC                       1208
#define T5CON_CKPS                    1209
#define T5CON_CKPS0                   1210
#define T5CKPS0                       1211
#define T5CON_CKPS1                   1212
#define T5CKPS1                       1213
#define T5CON_CS                      1214
#define T5CON_CS0                     1215
#define T5CS0                         1216
#define TMR5CS0                       1217
#define T5CON_CS1                     1218
#define T5CS1                         1219
#define TMR5CS1                       1220
#define T5GCON                        1221
#define T5GSS0                        1222
#define T5GCON_GSS0                   1223
#define T5GCON_GSS                    1224
#define T5GSS1                        1225
#define T5GCON_GSS1                   1226
#define T5GVAL                        1227
#define T5GCON_GVAL                   1228
#define T5GCON_GGO_nDONE              1229
#define T5GGO_nDONE                   1230
#define T5GSPM                        1231
#define T5GCON_GSPM                   1232
#define T5GTM                         1233
#define T5GCON_GTM                    1234
#define T5GPOL                        1235
#define T5GCON_GPOL                   1236
#define T5GE                          1237
#define TMR5GE                        1238
#define T5GCON_GE                     1239
#define OPA1NCHS                      1240
#define OPA1NCH                       1241
#define OPA1NCHS_NCH                  1242
#define OPA1PCHS                      1243
#define OPA1PCHS_PCH                  1244
#define OPA1PCH                       1245
#define OPA1CON                       1246
#define OPA1CON_ORM                   1247
#define OPA1ORM0                      1248
#define OPA1CON_ORM0                  1249
#define OPA1ORM                       1250
#define OPA1ORM1                      1251
#define OPA1CON_ORM1                  1252
#define OPA1CON_ORPOL                 1253
#define OPA1ORPOL                     1254
#define OPA1CON_UG                    1255
#define OPA1UG                        1256
#define OPA1CON_EN                    1257
#define OPA1EN                        1258
#define OPA1ORS                       1259
#define OPA1ORS_ORS                   1260
#define OPA2NCHS                      1261
#define OPA2NCHS_NCH                  1262
#define OPA2NCH                       1263
#define OPA2PCHS                      1264
#define OPA2PCHS_PCH                  1265
#define OPA2PCH                       1266
#define OPA2CON                       1267
#define OPA2CON_ORM0                  1268
#define OPA2ORM                       1269
#define OPA2ORM0                      1270
#define OPA2CON_ORM                   1271
#define OPA2CON_ORM1                  1272
#define OPA2ORM1                      1273
#define OPA2CON_ORPOL                 1274
#define OPA2ORPOL                     1275
#define OPA2CON_UG                    1276
#define OPA2UG                        1277
#define OPA2CON_EN                    1278
#define OPA2EN                        1279
#define OPA2ORS                       1280
#define OPA2ORS_ORS                   1281
#define DACLD                         1282
#define DAC1LD                        1283
#define DAC2LD                        1284
#define DAC1CON0                      1285
#define DAC1CON0_DACNSS0              1286
#define DAC1CON0_DACNSS               1287
#define DAC1CON0_NSS0                 1288
#define DAC1NSS                       1289
#define DAC1CON0_NSS                  1290
#define DAC1NSS0                      1291
#define DAC1CON0_DACPSS0              1292
#define DAC1CON0_PSS0                 1293
#define DAC1CON0_PSS                  1294
#define DAC1CON0_DACPSS               1295
#define DAC1PSS                       1296
#define DAC1PSS0                      1297
#define DAC1CON0_DACPSS1              1298
#define DAC1PSS1                      1299
#define DAC1CON0_PSS1                 1300
#define DAC1CON0_OE1                  1301
#define DAC1CON0_DACOE                1302
#define DAC1CON0_OE                   1303
#define DAC1OE1                       1304
#define DAC1CON0_DACOE1               1305
#define DAC1FM                        1306
#define DAC1CON0_FM                   1307
#define DAC1CON0_DACFM                1308
#define DAC1CON0_EN                   1309
#define DAC1CON0_DACEN                1310
#define DAC1EN                        1311
#define DAC1REFL                      1312
#define DAC1REF0                      1313
#define DAC1REFL_R0                   1314
#define DAC1REFL_REF0                 1315
#define DAC1R0                        1316
#define DAC1REF1                      1317
#define DAC1REFL_REF1                 1318
#define DAC1REFL_R1                   1319
#define DAC1R1                        1320
#define DAC1REF2                      1321
#define DAC1REFL_R2                   1322
#define DAC1REFL_REF2                 1323
#define DAC1R2                        1324
#define DAC1REF3                      1325
#define DAC1REFL_R3                   1326
#define DAC1REFL_REF3                 1327
#define DAC1R3                        1328
#define DAC1REF4                      1329
#define DAC1REFL_REF4                 1330
#define DAC1REFL_R4                   1331
#define DAC1R4                        1332
#define DAC1REFL_R5                   1333
#define DAC1REF5                      1334
#define DAC1REFL_REF5                 1335
#define DAC1R5                        1336
#define DAC1REF6                      1337
#define DAC1REFL_REF6                 1338
#define DAC1REFL_R6                   1339
#define DAC1R6                        1340
#define DAC1REF7                      1341
#define DAC1REFL_REF7                 1342
#define DAC1REFL_R7                   1343
#define DAC1R7                        1344
#define DAC1REFH                      1345
#define DAC1REFH_R8                   1346
#define DAC1REF8                      1347
#define DAC1REFH_REF8                 1348
#define DAC1R8                        1349
#define DAC1REF9                      1350
#define DAC1REFH_R9                   1351
#define DAC1REFH_REF9                 1352
#define DAC1R9                        1353
#define DAC1REFH_REF10                1354
#define DAC1R10                       1355
#define DAC1REF10                     1356
#define DAC1REFH_R10                  1357
#define DAC1REFH_REF11                1358
#define DAC1R11                       1359
#define DAC1REF11                     1360
#define DAC1REFH_R11                  1361
#define DAC1REFH_REF12                1362
#define DAC1REF12                     1363
#define DAC1R12                       1364
#define DAC1REFH_R12                  1365
#define DAC1REFH_REF13                1366
#define DAC1R13                       1367
#define DAC1REF13                     1368
#define DAC1REFH_R13                  1369
#define DAC1REFH_REF14                1370
#define DAC1R14                       1371
#define DAC1REF14                     1372
#define DAC1REFH_R14                  1373
#define DAC1REFH_REF15                1374
#define DAC1R15                       1375
#define DAC1REF15                     1376
#define DAC1REFH_R15                  1377
#define DAC2CON0                      1378
#define DAC2CON0_DACNSS               1379
#define DAC2CON0_NSS0                 1380
#define DAC2NSS                       1381
#define DAC2NSS0                      1382
#define DAC2CON0_NSS                  1383
#define DAC2CON0_DACNSS0              1384
#define DAC2CON0_DACPSS0              1385
#define DAC2PSS0                      1386
#define DAC2PSS                       1387
#define DAC2CON0_DACPSS               1388
#define DAC2CON0_PSS0                 1389
#define DAC2CON0_PSS                  1390
#define DAC2CON0_DACPSS1              1391
#define DAC2PSS1                      1392
#define DAC2CON0_PSS1                 1393
#define DAC2CON0_DACOE1               1394
#define DAC2CON0_OE1                  1395
#define DAC2CON0_DACOE                1396
#define DAC2OE1                       1397
#define DAC2CON0_OE                   1398
#define DAC2FM                        1399
#define DAC2CON0_DACFM                1400
#define DAC2CON0_FM                   1401
#define DAC2EN                        1402
#define DAC2CON0_DACEN                1403
#define DAC2CON0_EN                   1404
#define DAC2REFL                      1405
#define DAC2REF0                      1406
#define DAC2REFL_REF0                 1407
#define DAC2REFL_R0                   1408
#define DAC2R0                        1409
#define DAC2REF1                      1410
#define DAC2REFL_REF1                 1411
#define DAC2REFL_R1                   1412
#define DAC2R1                        1413
#define DAC2REF2                      1414
#define DAC2REFL_REF2                 1415
#define DAC2REFL_R2                   1416
#define DAC2R2                        1417
#define DAC2REF3                      1418
#define DAC2REFL_REF3                 1419
#define DAC2REFL_R3                   1420
#define DAC2R3                        1421
#define DAC2REF4                      1422
#define DAC2REFL_REF4                 1423
#define DAC2REFL_R4                   1424
#define DAC2R4                        1425
#define DAC2REF5                      1426
#define DAC2REFL_REF5                 1427
#define DAC2REFL_R5                   1428
#define DAC2R5                        1429
#define DAC2REF6                      1430
#define DAC2REFL_REF6                 1431
#define DAC2REFL_R6                   1432
#define DAC2R6                        1433
#define DAC2REF7                      1434
#define DAC2REFL_REF7                 1435
#define DAC2REFL_R7                   1436
#define DAC2R7                        1437
#define DAC2REFH                      1438
#define DAC2REF8                      1439
#define DAC2REFH_REF8                 1440
#define DAC2R8                        1441
#define DAC2REFH_R8                   1442
#define DAC2REF9                      1443
#define DAC2REFH_REF9                 1444
#define DAC2R9                        1445
#define DAC2REFH_R9                   1446
#define DAC2REFH_REF10                1447
#define DAC2REFH_R10                  1448
#define DAC2REF10                     1449
#define DAC2R10                       1450
#define DAC2REFH_R11                  1451
#define DAC2REFH_REF11                1452
#define DAC2REF11                     1453
#define DAC2R11                       1454
#define DAC2REFH_REF12                1455
#define DAC2REFH_R12                  1456
#define DAC2REF12                     1457
#define DAC2R12                       1458
#define DAC2REFH_R13                  1459
#define DAC2REF13                     1460
#define DAC2REFH_REF13                1461
#define DAC2R13                       1462
#define DAC2REFH_REF14                1463
#define DAC2REFH_R14                  1464
#define DAC2REF14                     1465
#define DAC2R14                       1466
#define DAC2REFH_REF15                1467
#define DAC2REFH_R15                  1468
#define DAC2R15                       1469
#define DAC2REF15                     1470
#define DAC3CON0                      1471
#define DAC3CON0_DACNSS               1472
#define DAC3NSS                       1473
#define DAC3CON0_NSS                  1474
#define DAC3CON0_PSS                  1475
#define DAC3PSS0                      1476
#define DAC3CON0_DACPSS               1477
#define DAC3PSS                       1478
#define DAC3CON0_PSS0                 1479
#define DAC3CON0_DACPSS0              1480
#define DAC3PSS1                      1481
#define DAC3CON0_PSS1                 1482
#define DAC3CON0_DACPSS1              1483
#define DAC3OE1                       1484
#define DAC3CON0_DACOE1               1485
#define DAC3CON0_OE1                  1486
#define DAC3EN                        1487
#define DAC3CON0_EN                   1488
#define DAC3CON0_DACEN                1489
#define DAC3REF                       1490
#define DAC3REF0                      1491
#define DAC3R                         1492
#define DAC3REF_R0                    1493
#define DAC3REF_REF0                  1494
#define DAC3REF_DACR                  1495
#define DAC3R0                        1496
#define DAC3REF_DACR0                 1497
#define DAC3REF1                      1498
#define DAC3REF_R1                    1499
#define DAC3REF_REF1                  1500
#define DAC3R1                        1501
#define DAC3REF_DACR1                 1502
#define DAC3REF2                      1503
#define DAC3REF_R2                    1504
#define DAC3REF_REF2                  1505
#define DAC3R2                        1506
#define DAC3REF_DACR2                 1507
#define DAC3REF3                      1508
#define DAC3REF_REF3                  1509
#define DAC3REF_R3                    1510
#define DAC3R3                        1511
#define DAC3REF_DACR3                 1512
#define DAC3REF4                      1513
#define DAC3REF_R4                    1514
#define DAC3REF_REF4                  1515
#define DAC3R4                        1516
#define DAC3REF_DACR4                 1517
#define DAC3REF5                      1518
#define DAC3REF_REF5                  1519
#define DAC4CON0                      1520
#define DAC4NSS                       1521
#define DAC4CON0_NSS                  1522
#define DAC4CON0_DACNSS               1523
#define DAC4PSS                       1524
#define DAC4CON0_DACPSS0              1525
#define DAC4CON0_PSS0                 1526
#define DAC4CON0_DACPSS               1527
#define DAC4PSS0                      1528
#define DAC4CON0_PSS                  1529
#define DAC4CON0_DACPSS1              1530
#define DAC4PSS1                      1531
#define DAC4CON0_PSS1                 1532
#define DAC4CON0_DACOE1               1533
#define DAC4OE1                       1534
#define DAC4CON0_OE1                  1535
#define DAC4CON0_EN                   1536
#define DAC4CON0_DACEN                1537
#define DAC4EN                        1538
#define DAC4REF                       1539
#define DAC4REF_DACR0                 1540
#define DAC4REF_REF0                  1541
#define DAC4REF_DACR                  1542
#define DAC4R0                        1543
#define DAC4REF_R0                    1544
#define DAC4REF0                      1545
#define DAC4R                         1546
#define DAC4REF_DACR1                 1547
#define DAC4REF_REF1                  1548
#define DAC4R1                        1549
#define DAC4REF_R1                    1550
#define DAC4REF1                      1551
#define DAC4REF_DACR2                 1552
#define DAC4REF_REF2                  1553
#define DAC4REF2                      1554
#define DAC4R2                        1555
#define DAC4REF_R2                    1556
#define DAC4REF_DACR3                 1557
#define DAC4REF_REF3                  1558
#define DAC4R3                        1559
#define DAC4REF_R3                    1560
#define DAC4REF3                      1561
#define DAC4REF_DACR4                 1562
#define DAC4REF_R4                    1563
#define DAC4REF_REF4                  1564
#define DAC4R4                        1565
#define DAC4REF4                      1566
#define DAC4REF_REF5                  1567
#define DAC4REF5                      1568
#define PWM3DCL                       1569
#define PWM3DC0                       1570
#define PWM3DCL_PWMPW0                1571
#define PWM3DCL_DC0                   1572
#define PWM3DCL_DC                    1573
#define PWM3DC1                       1574
#define PWM3DCL_PWMPW1                1575
#define PWM3DCL_DC1                   1576
#define PWM3DCH                       1577
#define PWM3DC2                       1578
#define PWM3DCH_DC2                   1579
#define PWM3DCH_DC                    1580
#define PWM3DCH_PWMPW2                1581
#define PWM3DC3                       1582
#define PWM3DCH_DC3                   1583
#define PWM3DCH_PWMPW3                1584
#define PWM3DC4                       1585
#define PWM3DCH_DC4                   1586
#define PWM3DCH_PWMPW4                1587
#define PWM3DC5                       1588
#define PWM3DCH_DC5                   1589
#define PWM3DCH_PWMPW5                1590
#define PWM3DC6                       1591
#define PWM3DCH_DC6                   1592
#define PWM3DCH_PWMPW6                1593
#define PWM3DC7                       1594
#define PWM3DCH_DC7                   1595
#define PWM3DCH_PWMPW7                1596
#define PWM3DC8                       1597
#define PWM3DCH_DC8                   1598
#define PWM3DCH_PWMPW8                1599
#define PWM3DC9                       1600
#define PWM3DCH_DC9                   1601
#define PWM3DCH_PWMPW9                1602
#define PWM3CON                       1603
#define PWM3CON_POL                   1604
#define PWM3POL                       1605
#define PWM3CON_OUT                   1606
#define PWM3OUT                       1607
#define PWM3EN                        1608
#define PWM3CON_EN                    1609
#define PWM4DCL                       1610
#define PWM4DCL_PWMPW0                1611
#define PWM4DCL_DC                    1612
#define PWM4DC0                       1613
#define PWM4DCL_DC0                   1614
#define PWM4DCL_PWMPW1                1615
#define PWM4DC1                       1616
#define PWM4DCL_DC1                   1617
#define PWM4DCH                       1618
#define PWM4DCH_PWMPW2                1619
#define PWM4DCH_DC                    1620
#define PWM4DC2                       1621
#define PWM4DCH_DC2                   1622
#define PWM4DCH_PWMPW3                1623
#define PWM4DC3                       1624
#define PWM4DCH_DC3                   1625
#define PWM4DCH_PWMPW4                1626
#define PWM4DC4                       1627
#define PWM4DCH_DC4                   1628
#define PWM4DCH_PWMPW5                1629
#define PWM4DC5                       1630
#define PWM4DCH_DC5                   1631
#define PWM4DCH_PWMPW6                1632
#define PWM4DC6                       1633
#define PWM4DCH_DC6                   1634
#define PWM4DCH_PWMPW7                1635
#define PWM4DC7                       1636
#define PWM4DCH_DC7                   1637
#define PWM4DCH_PWMPW8                1638
#define PWM4DC8                       1639
#define PWM4DCH_DC8                   1640
#define PWM4DCH_PWMPW9                1641
#define PWM4DC9                       1642
#define PWM4DCH_DC9                   1643
#define PWM4CON                       1644
#define PWM4POL                       1645
#define PWM4CON_POL                   1646
#define PWM4CON_OUT                   1647
#define PWM4OUT                       1648
