tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1768_tdd.h
#define PWM4EN                        1649
#define PWM4CON_EN                    1650
#define COG1PHR                       1651
#define G1PHR0                        1652
#define COG1PHR_PHR                   1653
#define COG1PHR_PHR0                  1654
#define G1PHR1                        1655
#define COG1PHR_PHR1                  1656
#define COG1PHR_PHR2                  1657
#define G1PHR2                        1658
#define COG1PHR_PHR3                  1659
#define G1PHR3                        1660
#define G1PHR4                        1661
#define COG1PHR_PHR4                  1662
#define G1PHR5                        1663
#define COG1PHR_PHR5                  1664
#define COG1PHF                       1665
#define G1PHF0                        1666
#define COG1PHF_PHF0                  1667
#define COG1PHF_PHF                   1668
#define G1PHF1                        1669
#define COG1PHF_PHF1                  1670
#define G1PHF2                        1671
#define COG1PHF_PHF2                  1672
#define G1PHF3                        1673
#define COG1PHF_PHF3                  1674
#define G1PHF4                        1675
#define COG1PHF_PHF4                  1676
#define G1PHF5                        1677
#define COG1PHF_PHF5                  1678
#define COG1BLKR                      1679
#define COG1BLKR_BLKR                 1680
#define COG1BLKR_BLKR0                1681
#define G1BLKR0                       1682
#define COG1BLKR_BLKR1                1683
#define G1BLKR1                       1684
#define COG1BLKR_BLKR2                1685
#define G1BLKR2                       1686
#define COG1BLKR_BLKR3                1687
#define G1BLKR3                       1688
#define COG1BLKR_BLKR4                1689
#define G1BLKR4                       1690
#define G1BLKR5                       1691
#define COG1BLKR_BLKR5                1692
#define COG1BLKF                      1693
#define COG1BLKF_BLKF                 1694
#define G1BLKF0                       1695
#define COG1BLKF_BLKF0                1696
#define G1BLKF1                       1697
#define COG1BLKF_BLKF1                1698
#define COG1BLKF_BLKF2                1699
#define G1BLKF2                       1700
#define G1BLKF3                       1701
#define COG1BLKF_BLKF3                1702
#define COG1BLKF_BLKF4                1703
#define G1BLKF4                       1704
#define G1BLKF5                       1705
#define COG1BLKF_BLKF5                1706
#define COG1DBR                       1707
#define G1DBR0                        1708
#define COG1DBR_DBR                   1709
#define COG1DBR_DBR0                  1710
#define G1DBR1                        1711
#define COG1DBR_DBR1                  1712
#define G1DBR2                        1713
#define COG1DBR_DBR2                  1714
#define G1DBR3                        1715
#define COG1DBR_DBR3                  1716
#define G1DBR4                        1717
#define COG1DBR_DBR4                  1718
#define G1DBR5                        1719
#define COG1DBR_DBR5                  1720
#define COG1DBF                       1721
#define COG1DBF_DBF0                  1722
#define G1DBF0                        1723
#define G1DBF                         1724
#define G1DBF1                        1725
#define COG1DBF_DBF1                  1726
#define G1DBF2                        1727
#define COG1DBF_DBF2                  1728
#define G1DBF3                        1729
#define COG1DBF_DBF3                  1730
#define G1DBF4                        1731
#define COG1DBF_DBF4                  1732
#define G1DBF5                        1733
#define COG1DBF_DBF5                  1734
#define COG1CON0                      1735
#define COG1CON0_MD                   1736
#define G1MD0                         1737
#define COG1CON0_MD0                  1738
#define G1MD                          1739
#define G1MD1                         1740
#define COG1CON0_MD1                  1741
#define G1MD2                         1742
#define COG1CON0_MD2                  1743
#define COG1CON0_CS0                  1744
#define G1CS                          1745
#define G1CS0                         1746
#define COG1CON0_CS                   1747
#define COG1CON0_CS1                  1748
#define G1CS1                         1749
#define G1LD                          1750
#define COG1CON0_LD                   1751
#define COG1CON0_EN                   1752
#define G1EN                          1753
#define COG1CON1                      1754
#define COG1CON1_POLA                 1755
#define G1POLA                        1756
#define COG1CON1_POLB                 1757
#define G1POLB                        1758
#define COG1CON1_POLC                 1759
#define G1POLC                        1760
#define COG1CON1_POLD                 1761
#define G1POLD                        1762
#define COG1CON1_FDBS                 1763
#define G1FDBS                        1764
#define COG1CON1_RDBS                 1765
#define G1RDBS                        1766
#define COG1RIS0                      1767
#define COG1RIS0_RIS0                 1768
#define G1RIS0                        1769
#define COG1RIS0_RIS1                 1770
#define G1RIS1                        1771
#define COG1RIS0_RIS2                 1772
#define G1RIS2                        1773
#define COG1RIS0_RIS3                 1774
#define G1RIS3                        1775
#define COG1RIS0_RIS4                 1776
#define G1RIS4                        1777
#define COG1RIS0_RIS5                 1778
#define G1RIS5                        1779
#define COG1RIS0_RIS6                 1780
#define G1RIS6                        1781
#define COG1RIS0_RIS7                 1782
#define G1RIS7                        1783
#define COG1RIS1                      1784
#define COG1RIS1_RIS8                 1785
#define G1RIS8                        1786
#define COG1RIS1_RIS9                 1787
#define G1RIS9                        1788
#define G1RIS10                       1789
#define COG1RIS1_RIS10                1790
#define G1RIS11                       1791
#define COG1RIS1_RIS11                1792
#define G1RIS12                       1793
#define COG1RIS1_RIS12                1794
#define G1RIS13                       1795
#define COG1RIS1_RIS13                1796
#define G1RIS14                       1797
#define RIS14                         1798
#define G1RIS15                       1799
#define RIS15                         1800
#define COG1RSIM0                     1801
#define G1RSIM0                       1802
#define COG1RSIM0_RSIM0               1803
#define G1RSIM1                       1804
#define COG1RSIM0_RSIM1               1805
#define G1RSIM2                       1806
#define COG1RSIM0_RSIM2               1807
#define G1RSIM3                       1808
#define COG1RSIM0_RSIM3               1809
#define G1RSIM4                       1810
#define COG1RSIM0_RSIM4               1811
#define G1RSIM5                       1812
#define COG1RSIM0_RSIM5               1813
#define G1RSIM6                       1814
#define COG1RSIM0_RSIM6               1815
#define G1RSIM7                       1816
#define COG1RSIM0_RSIM7               1817
#define COG1RSIM1                     1818
#define COG1RSIM1_RSIM8               1819
#define G1RSIM8                       1820
#define COG1RSIM1_RSIM9               1821
#define G1RSIM9                       1822
#define G1RSIM10                      1823
#define COG1RSIM1_RSIM10              1824
#define G1RSIM11                      1825
#define COG1RSIM1_RSIM11              1826
#define G1RSIM12                      1827
#define COG1RSIM1_RSIM12              1828
#define G1RSIM13                      1829
#define COG1RSIM1_RSIM13              1830
#define RSIM14                        1831
#define G1RSIM14                      1832
#define RSIM15                        1833
#define G1RSIM15                      1834
#define COG1FIS0                      1835
#define G1FIS0                        1836
#define COG1FIS0_FIS0                 1837
#define G1FIS1                        1838
#define COG1FIS0_FIS1                 1839
#define G1FIS2                        1840
#define COG1FIS0_FIS2                 1841
#define G1FIS3                        1842
#define COG1FIS0_FIS3                 1843
#define G1FIS4                        1844
#define COG1FIS0_FIS4                 1845
#define G1FIS5                        1846
#define COG1FIS0_FIS5                 1847
#define G1FIS6                        1848
#define COG1FIS0_FIS6                 1849
#define G1FIS7                        1850
#define COG1FIS0_FIS7                 1851
#define COG1FIS1                      1852
#define COG1FIS1_FIS8                 1853
#define G1FIS8                        1854
#define COG1FIS1_FIS9                 1855
#define G1FIS9                        1856
#define COG1FIS1_FIS10                1857
#define G1FIS10                       1858
#define COG1FIS1_FIS11                1859
#define G1FIS11                       1860
#define COG1FIS1_FIS12                1861
#define G1FIS12                       1862
#define COG1FIS1_FIS13                1863
#define G1FIS13                       1864
#define G1FIS14                       1865
#define FIS14                         1866
#define G1FIS15                       1867
#define FIS15                         1868
#define COG1FSIM0                     1869
#define COG1FSIM0_FSIM0               1870
#define G1FSIM0                       1871
#define COG1FSIM0_FSIM1               1872
#define G1FSIM1                       1873
#define COG1FSIM0_FSIM2               1874
#define G1FSIM2                       1875
#define COG1FSIM0_FSIM3               1876
#define G1FSIM3                       1877
#define COG1FSIM0_FSIM4               1878
#define G1FSIM4                       1879
#define COG1FSIM0_FSIM5               1880
#define G1FSIM5                       1881
#define COG1FSIM0_FSIM6               1882
#define G1FSIM6                       1883
#define COG1FSIM0_FSIM7               1884
#define G1FSIM7                       1885
#define COG1FSIM1                     1886
#define COG1FSIM1_FSIM8               1887
#define G1FSIM8                       1888
#define COG1FSIM1_FSIM9               1889
#define G1FSIM9                       1890
#define COG1FSIM1_FSIM10              1891
#define G1FSIM10                      1892
#define COG1FSIM1_FSIM11              1893
#define G1FSIM11                      1894
#define COG1FSIM1_FSIM12              1895
#define G1FSIM12                      1896
#define COG1FSIM1_FSIM13              1897
#define G1FSIM13                      1898
#define FSIM14                        1899
#define G1FSIM14                      1900
#define FSIM15                        1901
#define G1FSIM15                      1902
#define COG1ASD0                      1903
#define COG1ASD0_ASDAC0               1904
#define G1ASDAC0                      1905
#define COG1ASD0_ASDAC                1906
#define G1ASDAC                       1907
#define COG1ASD0_ASDAC1               1908
#define G1ASDAC1                      1909
#define G1ASDBD0                      1910
#define COG1ASD0_ASDBD0               1911
#define G1ASDBD                       1912
#define COG1ASD0_ASDBD                1913
#define G1ASDBD1                      1914
#define COG1ASD0_ASDBD1               1915
#define G1ASREN                       1916
#define COG1ASD0_ARSEN                1917
#define G1ARSEN                       1918
#define COG1ASD0_ASREN                1919
#define COG1ASD0_ASE                  1920
#define G1ASE                         1921
#define COG1ASD1                      1922
#define COG1ASD1_AS0E                 1923
#define G1AS0E                        1924
#define G1AS1E                        1925
#define COG1ASD1_AS1E                 1926
#define COG1ASD1_AS2E                 1927
#define G1AS2E                        1928
#define COG1ASD1_AS3E                 1929
#define G1AS3E                        1930
#define G1AS4E                        1931
#define COG1ASD1_AS4E                 1932
#define G1AS5E                        1933
#define COG1ASD1_AS5E                 1934
#define G1AS6E                        1935
#define COG1ASD1_AS6E                 1936
#define G1AS7E                        1937
#define COG1ASD1_AS7E                 1938
#define COG1STR                       1939
#define G1STRA                        1940
#define COG1STR_STRA                  1941
#define G1STRB                        1942
#define COG1STR_STRB                  1943
#define G1STRC                        1944
#define COG1STR_STRC                  1945
#define G1STRD                        1946
#define COG1STR_STRD                  1947
#define COG1STR_SDATA                 1948
#define G1SDATA                       1949
#define COG1STR_SDATB                 1950
#define G1SDATB                       1951
#define COG1STR_SDATC                 1952
#define G1SDATC                       1953
#define COG1STR_SDATD                 1954
#define G1SDATD                       1955
#define COG2PHR                       1956
#define G2PHR0                        1957
#define COG2PHR_PHR                   1958
#define COG2PHR_PHR0                  1959
#define G2PHR1                        1960
#define COG2PHR_PHR1                  1961
#define G2PHR2                        1962
#define COG2PHR_PHR2                  1963
#define G2PHR3                        1964
#define COG2PHR_PHR3                  1965
#define G2PHR4                        1966
#define COG2PHR_PHR4                  1967
#define G2PHR5                        1968
#define COG2PHR_PHR5                  1969
#define COG2PHF                       1970
#define COG2PHF_PHF                   1971
#define COG2PHF_PHF0                  1972
#define G2PHF0                        1973
#define COG2PHF_PHF1                  1974
#define G2PHF1                        1975
#define COG2PHF_PHF2                  1976
#define G2PHF2                        1977
#define G2PHF3                        1978
#define COG2PHF_PHF3                  1979
#define COG2PHF_PHF4                  1980
#define G2PHF4                        1981
#define COG2PHF_PHF5                  1982
#define G2PHF5                        1983
#define COG2BLKR                      1984
#define G2BLKR0                       1985
#define COG2BLKR_BLKR                 1986
#define COG2BLKR_BLKR0                1987
#define G2BLKR1                       1988
#define COG2BLKR_BLKR1                1989
#define G2BLKR2                       1990
#define COG2BLKR_BLKR2                1991
#define G2BLKR3                       1992
#define COG2BLKR_BLKR3                1993
#define G2BLKR4                       1994
#define COG2BLKR_BLKR4                1995
#define G2BLKR5                       1996
#define COG2BLKR_BLKR5                1997
#define COG2BLKF                      1998
#define COG2BLKF_BLKF                 1999
#define G2BLKF0                       2000
#define COG2BLKF_BLKF0                2001
#define COG2BLKF_BLKF1                2002
#define G2BLKF1                       2003
#define COG2BLKF_BLKF2                2004
#define G2BLKF2                       2005
#define COG2BLKF_BLKF3                2006
#define G2BLKF3                       2007
#define COG2BLKF_BLKF4                2008
#define G2BLKF4                       2009
#define COG2BLKF_BLKF5                2010
#define G2BLKF5                       2011
#define COG2DBR                       2012
#define COG2DBR_DBR0                  2013
#define G2DBR0                        2014
#define COG2DBR_DBR                   2015
#define COG2DBR_DBR1                  2016
#define G2DBR1                        2017
#define COG2DBR_DBR2                  2018
#define G2DBR2                        2019
#define COG2DBR_DBR3                  2020
#define G2DBR3                        2021
#define COG2DBR_DBR4                  2022
#define G2DBR4                        2023
#define COG2DBR_DBR5                  2024
#define G2DBR5                        2025
#define COG2DBF                       2026
#define G2DBF                         2027
#define G2DBF0                        2028
#define COG2DBF_DBF0                  2029
#define G2DBF1                        2030
#define COG2DBF_DBF1                  2031
#define G2DBF2                        2032
#define COG2DBF_DBF2                  2033
#define G2DBF3                        2034
#define COG2DBF_DBF3                  2035
#define G2DBF4                        2036
#define COG2DBF_DBF4                  2037
#define G2DBF5                        2038
#define COG2DBF_DBF5                  2039
#define COG2CON0                      2040
#define COG2CON0_MD0                  2041
#define G2MD                          2042
#define G2MD0                         2043
#define COG2CON0_MD                   2044
#define COG2CON0_MD1                  2045
#define G2MD1                         2046
#define COG2CON0_MD2                  2047
#define G2MD2                         2048
#define G2CS                          2049
#define COG2CON0_CS                   2050
#define COG2CON0_CS0                  2051
#define G2CS0                         2052
#define COG2CON0_CS1                  2053
#define G2CS1                         2054
#define COG2CON0_LD                   2055
#define G2LD                          2056
#define G2EN                          2057
#define COG2CON0_EN                   2058
#define COG2CON1                      2059
#define G2POLA                        2060
#define COG2CON1_POLA                 2061
#define G2POLB                        2062
#define COG2CON1_POLB                 2063
#define G2POLC                        2064
#define COG2CON1_POLC                 2065
#define G2POLD                        2066
#define COG2CON1_POLD                 2067
#define COG2CON1_FDBS                 2068
#define G2FDBS                        2069
#define G2RDBS                        2070
#define COG2CON1_RDBS                 2071
#define COG2RIS0                      2072
#define G2RIS0                        2073
#define COG2RIS0_RIS0                 2074
#define G2RIS1                        2075
#define COG2RIS0_RIS1                 2076
#define G2RIS2                        2077
#define COG2RIS0_RIS2                 2078
#define G2RIS3                        2079
#define COG2RIS0_RIS3                 2080
#define G2RIS4                        2081
#define COG2RIS0_RIS4                 2082
#define G2RIS5                        2083
#define COG2RIS0_RIS5                 2084
#define G2RIS6                        2085
#define COG2RIS0_RIS6                 2086
#define G2RIS7                        2087
#define COG2RIS0_RIS7                 2088
#define COG2RIS1                      2089
#define G2RIS8                        2090
#define COG2RIS1_RIS8                 2091
#define COG2RIS1_RIS9                 2092
#define G2RIS9                        2093
#define COG2RIS1_RIS10                2094
#define G2RIS10                       2095
#define COG2RIS1_RIS11                2096
#define G2RIS11                       2097
#define COG2RIS1_RIS12                2098
#define G2RIS12                       2099
#define COG2RIS1_RIS13                2100
#define G2RIS13                       2101
#define COG2RSIM0                     2102
#define G2RSIM0                       2103
#define COG2RSIM0_RSIM0               2104
#define G2RSIM1                       2105
#define COG2RSIM0_RSIM1               2106
#define G2RSIM2                       2107
#define COG2RSIM0_RSIM2               2108
#define G2RSIM3                       2109
#define COG2RSIM0_RSIM3               2110
#define G2RSIM4                       2111
#define COG2RSIM0_RSIM4               2112
#define G2RSIM5                       2113
#define COG2RSIM0_RSIM5               2114
#define G2RSIM6                       2115
#define COG2RSIM0_RSIM6               2116
#define G2RSIM7                       2117
#define COG2RSIM0_RSIM7               2118
#define COG2RSIM1                     2119
#define COG2RSIM1_RSIM8               2120
#define G2RSIM8                       2121
#define COG2RSIM1_RSIM9               2122
#define G2RSIM9                       2123
#define COG2RSIM1_RSIM10              2124
#define G2RSIM10                      2125
#define COG2RSIM1_RSIM11              2126
#define G2RSIM11                      2127
#define G2RSIM12                      2128
#define COG2RSIM1_RSIM12              2129
#define G2RSIM13                      2130
#define COG2RSIM1_RSIM13              2131
#define COG2FIS0                      2132
#define G2FIS0                        2133
#define COG2FIS0_FIS0                 2134
#define G2FIS1                        2135
#define COG2FIS0_FIS1                 2136
#define G2FIS2                        2137
#define COG2FIS0_FIS2                 2138
#define G2FIS3                        2139
#define COG2FIS0_FIS3                 2140
#define G2FIS4                        2141
#define COG2FIS0_FIS4                 2142
#define G2FIS5                        2143
#define COG2FIS0_FIS5                 2144
#define G2FIS6                        2145
#define COG2FIS0_FIS6                 2146
#define G2FIS7                        2147
#define COG2FIS0_FIS7                 2148
#define COG2FIS1                      2149
#define COG2FIS1_FIS8                 2150
#define G2FIS8                        2151
#define COG2FIS1_FIS9                 2152
#define G2FIS9                        2153
#define COG2FIS1_FIS10                2154
#define G2FIS10                       2155
#define COG2FIS1_FIS11                2156
#define G2FIS11                       2157
#define COG2FIS1_FIS12                2158
#define G2FIS12                       2159
#define COG2FIS1_FIS13                2160
#define G2FIS13                       2161
#define COG2FSIM0                     2162
#define COG2FSIM0_FSIM0               2163
#define G2FSIM0                       2164
#define COG2FSIM0_FSIM1               2165
#define G2FSIM1                       2166
#define COG2FSIM0_FSIM2               2167
#define G2FSIM2                       2168
#define COG2FSIM0_FSIM3               2169
#define G2FSIM3                       2170
#define G2FSIM4                       2171
#define COG2FSIM0_FSIM4               2172
#define G2FSIM5                       2173
#define COG2FSIM0_FSIM5               2174
#define COG2FSIM0_FSIM6               2175
#define G2FSIM6                       2176
#define G2FSIM7                       2177
#define COG2FSIM0_FSIM7               2178
#define COG2FSIM1                     2179
#define G2FSIM8                       2180
#define COG2FSIM1_FSIM8               2181
#define G2FSIM9                       2182
#define COG2FSIM1_FSIM9               2183
#define G2FSIM10                      2184
#define COG2FSIM1_FSIM10              2185
#define G2FSIM11                      2186
#define COG2FSIM1_FSIM11              2187
#define G2FSIM12                      2188
#define COG2FSIM1_FSIM12              2189
#define G2FSIM13                      2190
#define COG2FSIM1_FSIM13              2191
#define COG2ASD0                      2192
#define COG2ASD0_ASDAC0               2193
#define G2ASDAC                       2194
#define COG2ASD0_ASDAC                2195
#define G2ASDAC0                      2196
#define COG2ASD0_ASDAC1               2197
#define G2ASDAC1                      2198
#define COG2ASD0_ASDBD                2199
#define G2ASDBD0                      2200
#define COG2ASD0_ASDBD0               2201
#define G2ASDBD                       2202
#define G2ASDBD1                      2203
#define COG2ASD0_ASDBD1               2204
#define G2ARSEN                       2205
#define COG2ASD0_ARSEN                2206
